## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_mdm_artifact.bootstrap-pkg will be created
  + resource "zentral_mdm_artifact" "bootstrap-pkg" {
      + auto_update                    = false
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = true
      + name                           = "Monolith - Bootstrap package"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = [
          + (known after apply),
        ]
      + type                           = "Enterprise App"
    }

  # zentral_mdm_artifact.monolith-default-enrollment will be created
  + resource "zentral_mdm_artifact" "monolith-default-enrollment" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "Monolith - Default enrollment"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.osquery-tcc will be created
  + resource "zentral_mdm_artifact" "osquery-tcc" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "Osquery - TCC"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.santa-default-configuration will be created
  + resource "zentral_mdm_artifact" "santa-default-configuration" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "Santa - Default configuration"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.santa-notificationsettings will be created
  + resource "zentral_mdm_artifact" "santa-notificationsettings" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "Santa - Notification settings"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.santa-system-extension-policy will be created
  + resource "zentral_mdm_artifact" "santa-system-extension-policy" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "Santa - System Extension policy"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.santa-tcc will be created
  + resource "zentral_mdm_artifact" "santa-tcc" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "Santa - TCC"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.servicemanagement will be created
  + resource "zentral_mdm_artifact" "servicemanagement" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "All - Managed Login Items settings"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.system-logging will be created
  + resource "zentral_mdm_artifact" "system-logging" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "system logging - enable private data"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_blueprint.default will be created
  + resource "zentral_mdm_blueprint" "default" {
      + collect_apps                    = "ALL"
      + collect_certificates            = "ALL"
      + collect_profiles                = "ALL"
      + id                              = (known after apply)
      + inventory_interval              = 86400
      + name                            = "Default"
      + software_update_enforcement_ids = (known after apply)
    }

  # zentral_mdm_blueprint_artifact.bootstrap-pkg will be created
  + resource "zentral_mdm_blueprint_artifact" "bootstrap-pkg" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.monolith-default-enrollment will be created
  + resource "zentral_mdm_blueprint_artifact" "monolith-default-enrollment" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.osquery-tcc will be created
  + resource "zentral_mdm_blueprint_artifact" "osquery-tcc" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.santa-default-configuration will be created
  + resource "zentral_mdm_blueprint_artifact" "santa-default-configuration" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.santa-notificationsettings will be created
  + resource "zentral_mdm_blueprint_artifact" "santa-notificationsettings" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.santa-system-extension-policy will be created
  + resource "zentral_mdm_blueprint_artifact" "santa-system-extension-policy" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.santa-tcc will be created
  + resource "zentral_mdm_blueprint_artifact" "santa-tcc" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.servicemanagement will be created
  + resource "zentral_mdm_blueprint_artifact" "servicemanagement" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.system-logging will be created
  + resource "zentral_mdm_blueprint_artifact" "system-logging" {
      + artifact_id        = (known after apply)
      + blueprint_id       = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_enterprise_app.bootstrap-pkg-2024-001 will be created
  + resource "zentral_mdm_enterprise_app" "bootstrap-pkg-2024-001" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + install_as_managed = false
      + ios                = false
      + ios_app            = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + package_sha256     = "18b128e6e900ed42624ea9f574f7af8f3df8c6c8d0263981d6fee639c95b73f4"
      + package_uri        = "s3://zentral-pro-services-artifacts-eu-central-1/saas-public/bootstrap-2024.007.pkg"
      + remove_on_unenroll = false
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_ota_enrollment.default will be created
  + resource "zentral_mdm_ota_enrollment" "default" {
      + blueprint_id          = (known after apply)
      + display_name          = "Zentral MDM"
      + id                    = (known after apply)
      + meta_business_unit_id = (known after apply)
      + name                  = "Default"
      + push_certificate_id   = 1
      + scep_config_id        = 1
      + scep_verification     = false
      + secret                = (known after apply)
      + serial_numbers        = (known after apply)
      + tag_ids               = (known after apply)
      + udids                 = (known after apply)
    }

  # zentral_mdm_profile.monolith-default-enrollment-1 will be created
  + resource "zentral_mdm_profile" "monolith-default-enrollment-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = (known after apply)
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.osquery-tcc-1 will be created
  + resource "zentral_mdm_profile" "osquery-tcc-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCTxzdHJpbmc+Q29uZmlndXJhdGlvbjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KCTxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRDb250ZW50PC9rZXk+Cgk8YXJyYXk+CgkJPGRpY3Q+CgkJCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCQkJPHN0cmluZz5jb20uYXBwbGUuVENDLmNvbmZpZ3VyYXRpb24tcHJvZmlsZS1wb2xpY3k8L3N0cmluZz4KCQkJPGtleT5TZXJ2aWNlczwva2V5PgoJCQk8ZGljdD4KCQkJCTxrZXk+U3lzdGVtUG9saWN5QWxsRmlsZXM8L2tleT4KCQkJCTxhcnJheT4KCQkJCQk8ZGljdD4KCQkJCQkJPGtleT5BbGxvd2VkPC9rZXk+CgkJCQkJCTx0cnVlLz4KCQkJCQkJPGtleT5Db2RlUmVxdWlyZW1lbnQ8L2tleT4KICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPHN0cmluZz5pZGVudGlmaWVyICJpby5vc3F1ZXJ5LmFnZW50IiBhbmQgYW5jaG9yIGFwcGxlIGdlbmVyaWMgYW5kIGNlcnRpZmljYXRlIDFbZmllbGQuMS4yLjg0MC4xMTM2MzUuMTAwLjYuMi42XSAvKiBleGlzdHMgKi8gYW5kIGNlcnRpZmljYXRlIGxlYWZbZmllbGQuMS4yLjg0MC4xMTM2MzUuMTAwLjYuMS4xM10gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW3N1YmplY3QuT1VdID0gIjM1MjJGQTlQWEYiPC9zdHJpbmc+CgkJCQkJCTxrZXk+Q29tbWVudDwva2V5PgoJCQkJCQk8c3RyaW5nPjwvc3RyaW5nPgoJCQkJCQk8a2V5PklkZW50aWZpZXI8L2tleT4KCQkJCQkJPHN0cmluZz5pby5vc3F1ZXJ5LmFnZW50PC9zdHJpbmc+CgkJCQkJCTxrZXk+SWRlbnRpZmllclR5cGU8L2tleT4KCQkJCQkJPHN0cmluZz5idW5kbGVJRDwvc3RyaW5nPgoJCQkJCQk8a2V5PlN0YXRpY0NvZGU8L2tleT4KCQkJCQkJPGZhbHNlLz4KCQkJCQk8L2RpY3Q+CgkJCQk8L2FycmF5PgoJCQk8L2RpY3Q+CgkJCTxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CgkJCTxzdHJpbmc+UHJpdmFjeSBQcmVmZXJlbmNlcyBQb2xpY3kgQ29udHJvbDwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KCQkJPHN0cmluZz5aZW50cmFsIENsb3VkPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCQkJPHN0cmluZz5jbG91ZC56ZW50cmFsLm9zcXVlcnkuVENDLjA8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJCQk8c3RyaW5nPkM5NDcyNDQyLTc4NkMtNEI3RC04ODk3LUU4NUI2NkJGOEU3ODwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CgkJCTxpbnRlZ2VyPjE8L2ludGVnZXI+CgkJPC9kaWN0PgoJPC9hcnJheT4KCTxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+Cgk8c3RyaW5nPk9zcXVlcnkgVENDIHNldHRpbmdzPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5PgoJPHN0cmluZz5Db25maWd1cmVzIHlvdXIgTWFjIHRvIGF1dG9tYXRpY2FsbHkgZ2l2ZSBPc3F1ZXJ5IGZ1bGwgZGlzayBhY2Nlc3M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5aZW50cmFsIENsb3VkPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+Cgk8c3RyaW5nPmNsb3VkLnplbnRyYWwub3NxdWVyeS5UQ0M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCTxzdHJpbmc+NjkwNTJCQ0UtQzE2MC00MURELUI2NDktMUZGNzZCRDRGRjNBPC9zdHJpbmc+CiAgICAgICAgPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+Cgk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+Cgk8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8L2RpY3Q+CjwvcGxpc3Q+Cg=="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.santa-default-configuration-1 will be created
  + resource "zentral_mdm_profile" "santa-default-configuration-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = (known after apply)
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.santa-notificationsettings-1 will be created
  + resource "zentral_mdm_profile" "santa-notificationsettings-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCTxzdHJpbmc+Q29uZmlndXJhdGlvbjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KCTxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRDb250ZW50PC9rZXk+Cgk8YXJyYXk+CgkJPGRpY3Q+CgkJCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCQkJPHN0cmluZz5jb20uYXBwbGUubm90aWZpY2F0aW9uc2V0dGluZ3M8L3N0cmluZz4KCQkJPGtleT5Ob3RpZmljYXRpb25TZXR0aW5nczwva2V5PgoJCQk8YXJyYXk+CgkJCQk8ZGljdD4KCQkJCQk8a2V5PkFsZXJ0VHlwZTwva2V5PgoJCQkJCTxpbnRlZ2VyPjE8L2ludGVnZXI+CgkJCQkJPGtleT5CYWRnZXNFbmFibGVkPC9rZXk+CgkJCQkJPHRydWUvPgoJCQkJCTxrZXk+QnVuZGxlSWRlbnRpZmllcjwva2V5PgoJCQkJCTxzdHJpbmc+Y29tLmdvb2dsZS5zYW50YTwvc3RyaW5nPgoJCQkJCTxrZXk+Q3JpdGljYWxBbGVydEVuYWJsZWQ8L2tleT4KCQkJCQk8dHJ1ZS8+CgkJCQkJPGtleT5Ob3RpZmljYXRpb25zRW5hYmxlZDwva2V5PgoJCQkJCTx0cnVlLz4KCQkJCQk8a2V5PlNob3dJbkxvY2tTY3JlZW48L2tleT4KCQkJCQk8dHJ1ZS8+CgkJCQkJPGtleT5TaG93SW5Ob3RpZmljYXRpb25DZW50ZXI8L2tleT4KCQkJCQk8dHJ1ZS8+CgkJCQkJPGtleT5Tb3VuZHNFbmFibGVkPC9rZXk+CgkJCQkJPGZhbHNlLz4KCQkJCTwvZGljdD4KCQkJPC9hcnJheT4KCQkJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCQkJPHN0cmluZz5Ob3RpZmljYXRpb25zIHNldHRpbmdzPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJCQk8c3RyaW5nPlplbnRyYWwgQ2xvdWQ8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmNsb3VkLnplbnRyYWwuc2FudGEubm90aWZpY2F0aW9uc2V0dGluZ3MuMDwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRVVUlEPC9rZXk+CgkJCTxzdHJpbmc+RkNCRTY4MUItNzQ1Ri00REJGLUE5MDctNkY1OEM4RjgyNjg3PC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KCQkJPGludGVnZXI+MTwvaW50ZWdlcj4KCQk8L2RpY3Q+Cgk8L2FycmF5PgoJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCTxzdHJpbmc+U2FudGEgbm90aWZpY2F0aW9ucyBzZXR0aW5nczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KCTxzdHJpbmc+Q29uZmlndXJlcyB5b3VyIE1hYyB0byBhdXRvbWF0aWNhbGx5IGVuYWJsZSBTYW50YSdzIG5vdGlmaWNhdGlvbnM8L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5aZW50cmFsIENsb3VkPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+Cgk8c3RyaW5nPmNsb3VkLnplbnRyYWwuc2FudGEubm90aWZpY2F0aW9uc2V0dGluZ3M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCTxzdHJpbmc+NEE1MUJCMDEtNDVCMS00RDQ2LTgxRTgtMzU4MzlFMkUxOUI5PC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+Cgk8aW50ZWdlcj4xPC9pbnRlZ2VyPgoJPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KCTx0cnVlLz4KPC9kaWN0Pgo8L3BsaXN0Pgo="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.santa-system-extension-policy-1 will be created
  + resource "zentral_mdm_profile" "santa-system-extension-policy-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+Cgk8a2V5PlBheWxvYWRUeXBlPC9rZXk+Cgk8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KCTxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+Cgk8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgoJPGtleT5QYXlsb2FkQ29udGVudDwva2V5PgoJPGFycmF5PgoJCTxkaWN0PgoJCQk8a2V5PlBheWxvYWRUeXBlPC9rZXk+CgkJCTxzdHJpbmc+Y29tLmFwcGxlLnN5c3RlbS1leHRlbnNpb24tcG9saWN5PC9zdHJpbmc+CgkJCTxrZXk+QWxsb3dVc2VyT3ZlcnJpZGVzPC9rZXk+CgkJCTx0cnVlLz4KCQkJPGtleT5BbGxvd2VkU3lzdGVtRXh0ZW5zaW9uczwva2V5PgoJCQk8ZGljdD4KCQkJCTxrZXk+RVFIWFo4TThBVjwva2V5PgoJCQkJPGFycmF5PgoJCQkJCTxzdHJpbmc+Y29tLmdvb2dsZS5zYW50YS5kYWVtb248L3N0cmluZz4KCQkJCTwvYXJyYXk+CgkJCTwvZGljdD4KCQkJPGtleT5BbGxvd2VkU3lzdGVtRXh0ZW5zaW9uVHlwZXM8L2tleT4KCQkJPGRpY3Q+CgkJCQk8a2V5PkVRSFhaOE04QVY8L2tleT4KCQkJCTxhcnJheT4KCQkJCQk8c3RyaW5nPkVuZHBvaW50U2VjdXJpdHlFeHRlbnNpb248L3N0cmluZz4KCQkJCTwvYXJyYXk+CgkJCTwvZGljdD4KCQkJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCQkJPHN0cmluZz5TeXN0ZW0gRXh0ZW5zaW9uczwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KCQkJPHN0cmluZz5aZW50cmFsIENsb3VkPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCQkJPHN0cmluZz5jbG91ZC56ZW50cmFsLnNhbnRhLnN5c3RlbS1leHRlbnNpb24tcG9saWN5LjA8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJCQk8c3RyaW5nPjVCQUEwRTcyLTVBMUItNDNFQi04ODRCLTM2QjlCQzNCNDc2Qzwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CgkJCTxpbnRlZ2VyPjE8L2ludGVnZXI+CgkJPC9kaWN0PgoJPC9hcnJheT4KCTxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+Cgk8c3RyaW5nPlNhbnRhIHN5c2V4dCBzZXR0aW5nczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KCTxzdHJpbmc+Q29uZmlndXJlcyB5b3VyIE1hYyB0byBhdXRvbWF0aWNhbGx5IGVuYWJsZSBTYW50YSdzIEVuZHBvaW50U2VjdXJpdHlFeHRlbnNpb248L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5aZW50cmFsIENsb3VkPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+Cgk8c3RyaW5nPmNsb3VkLnplbnRyYWwuc2FudGEuc3lzdGVtLWV4dGVuc2lvbi1wb2xpY3k8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCTxzdHJpbmc+NEZBM0RBOTktOUM2Mi00OUQzLUE1QjMtOTAwREREQjM4RDY2PC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+Cgk8aW50ZWdlcj4xPC9pbnRlZ2VyPgoJPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KCTx0cnVlLz4KPC9kaWN0Pgo8L3BsaXN0Pgo="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.santa-tcc-1 will be created
  + resource "zentral_mdm_profile" "santa-tcc-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCTxzdHJpbmc+Q29uZmlndXJhdGlvbjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KCTxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRDb250ZW50PC9rZXk+Cgk8YXJyYXk+CgkJPGRpY3Q+CgkJCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCQkJPHN0cmluZz5jb20uYXBwbGUuVENDLmNvbmZpZ3VyYXRpb24tcHJvZmlsZS1wb2xpY3k8L3N0cmluZz4KCQkJPGtleT5TZXJ2aWNlczwva2V5PgoJCQk8ZGljdD4KCQkJCTxrZXk+U3lzdGVtUG9saWN5QWxsRmlsZXM8L2tleT4KCQkJCTxhcnJheT4KCQkJCQk8ZGljdD4KCQkJCQkJPGtleT5BbGxvd2VkPC9rZXk+CgkJCQkJCTx0cnVlLz4KCQkJCQkJPGtleT5Db2RlUmVxdWlyZW1lbnQ8L2tleT4KCQkJCQkJPHN0cmluZz5pZGVudGlmaWVyICJjb20uZ29vZ2xlLnNhbnRhLmRhZW1vbiIgYW5kIGFuY2hvciBhcHBsZSBnZW5lcmljIGFuZCBjZXJ0aWZpY2F0ZSAxW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjIuNl0gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjEuMTNdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltzdWJqZWN0Lk9VXSA9IEVRSFhaOE04QVY8L3N0cmluZz4KCQkJCQkJPGtleT5Db21tZW50PC9rZXk+CgkJCQkJCTxzdHJpbmc+PC9zdHJpbmc+CgkJCQkJCTxrZXk+SWRlbnRpZmllcjwva2V5PgoJCQkJCQk8c3RyaW5nPmNvbS5nb29nbGUuc2FudGEuZGFlbW9uPC9zdHJpbmc+CgkJCQkJCTxrZXk+SWRlbnRpZmllclR5cGU8L2tleT4KCQkJCQkJPHN0cmluZz5idW5kbGVJRDwvc3RyaW5nPgoJCQkJCQk8a2V5PlN0YXRpY0NvZGU8L2tleT4KCQkJCQkJPGZhbHNlLz4KCQkJCQk8L2RpY3Q+CgkJCQkJPGRpY3Q+CgkJCQkJCTxrZXk+QWxsb3dlZDwva2V5PgoJCQkJCQk8dHJ1ZS8+CgkJCQkJCTxrZXk+Q29kZVJlcXVpcmVtZW50PC9rZXk+CgkJCQkJCTxzdHJpbmc+aWRlbnRpZmllciAiY29tLmdvb2dsZS5zYW50YS5idW5kbGVzZXJ2aWNlIiBhbmQgYW5jaG9yIGFwcGxlIGdlbmVyaWMgYW5kIGNlcnRpZmljYXRlIDFbZmllbGQuMS4yLjg0MC4xMTM2MzUuMTAwLjYuMi42XSAvKiBleGlzdHMgKi8gYW5kIGNlcnRpZmljYXRlIGxlYWZbZmllbGQuMS4yLjg0MC4xMTM2MzUuMTAwLjYuMS4xM10gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW3N1YmplY3QuT1VdID0gRVFIWFo4TThBVjwvc3RyaW5nPgoJCQkJCQk8a2V5PkNvbW1lbnQ8L2tleT4KCQkJCQkJPHN0cmluZz48L3N0cmluZz4KCQkJCQkJPGtleT5JZGVudGlmaWVyPC9rZXk+CgkJCQkJCTxzdHJpbmc+Y29tLmdvb2dsZS5zYW50YS5idW5kbGVzZXJ2aWNlPC9zdHJpbmc+CgkJCQkJCTxrZXk+SWRlbnRpZmllclR5cGU8L2tleT4KCQkJCQkJPHN0cmluZz5idW5kbGVJRDwvc3RyaW5nPgoJCQkJCQk8a2V5PlN0YXRpY0NvZGU8L2tleT4KCQkJCQkJPGZhbHNlLz4KCQkJCQk8L2RpY3Q+CgkJCQkJPGRpY3Q+CgkJCQkJCTxrZXk+QWxsb3dlZDwva2V5PgoJCQkJCQk8dHJ1ZS8+CgkJCQkJCTxrZXk+Q29kZVJlcXVpcmVtZW50PC9rZXk+CgkJCQkJCTxzdHJpbmc+aWRlbnRpZmllciAiY29tLmdvb2dsZS5zYW50YSIgYW5kIGFuY2hvciBhcHBsZSBnZW5lcmljIGFuZCBjZXJ0aWZpY2F0ZSAxW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjIuNl0gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjEuMTNdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltzdWJqZWN0Lk9VXSA9IEVRSFhaOE04QVY8L3N0cmluZz4KCQkJCQkJPGtleT5Db21tZW50PC9rZXk+CgkJCQkJCTxzdHJpbmc+PC9zdHJpbmc+CgkJCQkJCTxrZXk+SWRlbnRpZmllcjwva2V5PgoJCQkJCQk8c3RyaW5nPmNvbS5nb29nbGUuc2FudGE8L3N0cmluZz4KCQkJCQkJPGtleT5JZGVudGlmaWVyVHlwZTwva2V5PgoJCQkJCQk8c3RyaW5nPmJ1bmRsZUlEPC9zdHJpbmc+CgkJCQkJCTxrZXk+U3RhdGljQ29kZTwva2V5PgoJCQkJCQk8ZmFsc2UvPgoJCQkJCTwvZGljdD4KCQkJCTwvYXJyYXk+CgkJCTwvZGljdD4KCQkJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCQkJPHN0cmluZz5Qcml2YWN5IFByZWZlcmVuY2VzIFBvbGljeSBDb250cm9sPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJCQk8c3RyaW5nPlplbnRyYWwgQ2xvdWQ8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmNsb3VkLnplbnRyYWwuc2FudGEuVENDLjA8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJCQk8c3RyaW5nPjVBOTk4MkE3LTFGQzUtNDBCOS04RTlCLTU4NzVFMDYzQUNBMDwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CgkJCTxpbnRlZ2VyPjE8L2ludGVnZXI+CgkJPC9kaWN0PgoJPC9hcnJheT4KCTxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+Cgk8c3RyaW5nPlNhbnRhIFRDQyBzZXR0aW5nczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KCTxzdHJpbmc+Q29uZmlndXJlcyB5b3VyIE1hYyB0byBhdXRvbWF0aWNhbGx5IGdpdmUgU2FudGEgZnVsbCBkaXNrIGFjY2Vzczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+Cgk8c3RyaW5nPlplbnRyYWwgQ2xvdWQ8L3N0cmluZz4KCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCTxzdHJpbmc+Y2xvdWQuemVudHJhbC5zYW50YS5UQ0M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCTxzdHJpbmc+NEE0QUZEQzgtRTA2MS00NUJDLThBNzktQUJCNEYzRjVCODlBPC9zdHJpbmc+CiAgICAgICAgPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+Cgk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+Cgk8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8L2RpY3Q+CjwvcGxpc3Q+Cg=="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.servicemanagement-1 will be created
  + resource "zentral_mdm_profile" "serv
--- TRUNCATED ---
```
</details>